Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca90_cult/pic32cz_ca90_tcm_performance/firmware/src/packs/PIC32CZ8110CA90208_DFP/component/tram.h
#define TRAM_RAM1248_REG_OFST          _UINT32_(0x2380)    /* (TRAM_RAM1248) TrustRAM Offset */
#define TRAM_RAM1249_REG_OFST          _UINT32_(0x2384)    /* (TRAM_RAM1249) TrustRAM Offset */
#define TRAM_RAM1250_REG_OFST          _UINT32_(0x2388)    /* (TRAM_RAM1250) TrustRAM Offset */
#define TRAM_RAM1251_REG_OFST          _UINT32_(0x238C)    /* (TRAM_RAM1251) TrustRAM Offset */
#define TRAM_RAM1252_REG_OFST          _UINT32_(0x2390)    /* (TRAM_RAM1252) TrustRAM Offset */
#define TRAM_RAM1253_REG_OFST          _UINT32_(0x2394)    /* (TRAM_RAM1253) TrustRAM Offset */
#define TRAM_RAM1254_REG_OFST          _UINT32_(0x2398)    /* (TRAM_RAM1254) TrustRAM Offset */
#define TRAM_RAM1255_REG_OFST          _UINT32_(0x239C)    /* (TRAM_RAM1255) TrustRAM Offset */
#define TRAM_RAM1256_REG_OFST          _UINT32_(0x23A0)    /* (TRAM_RAM1256) TrustRAM Offset */
#define TRAM_RAM1257_REG_OFST          _UINT32_(0x23A4)    /* (TRAM_RAM1257) TrustRAM Offset */
#define TRAM_RAM1258_REG_OFST          _UINT32_(0x23A8)    /* (TRAM_RAM1258) TrustRAM Offset */
#define TRAM_RAM1259_REG_OFST          _UINT32_(0x23AC)    /* (TRAM_RAM1259) TrustRAM Offset */
#define TRAM_RAM1260_REG_OFST          _UINT32_(0x23B0)    /* (TRAM_RAM1260) TrustRAM Offset */
#define TRAM_RAM1261_REG_OFST          _UINT32_(0x23B4)    /* (TRAM_RAM1261) TrustRAM Offset */
#define TRAM_RAM1262_REG_OFST          _UINT32_(0x23B8)    /* (TRAM_RAM1262) TrustRAM Offset */
#define TRAM_RAM1263_REG_OFST          _UINT32_(0x23BC)    /* (TRAM_RAM1263) TrustRAM Offset */
#define TRAM_RAM1264_REG_OFST          _UINT32_(0x23C0)    /* (TRAM_RAM1264) TrustRAM Offset */
#define TRAM_RAM1265_REG_OFST          _UINT32_(0x23C4)    /* (TRAM_RAM1265) TrustRAM Offset */
#define TRAM_RAM1266_REG_OFST          _UINT32_(0x23C8)    /* (TRAM_RAM1266) TrustRAM Offset */
#define TRAM_RAM1267_REG_OFST          _UINT32_(0x23CC)    /* (TRAM_RAM1267) TrustRAM Offset */
#define TRAM_RAM1268_REG_OFST          _UINT32_(0x23D0)    /* (TRAM_RAM1268) TrustRAM Offset */
#define TRAM_RAM1269_REG_OFST          _UINT32_(0x23D4)    /* (TRAM_RAM1269) TrustRAM Offset */
#define TRAM_RAM1270_REG_OFST          _UINT32_(0x23D8)    /* (TRAM_RAM1270) TrustRAM Offset */
#define TRAM_RAM1271_REG_OFST          _UINT32_(0x23DC)    /* (TRAM_RAM1271) TrustRAM Offset */
#define TRAM_RAM1272_REG_OFST          _UINT32_(0x23E0)    /* (TRAM_RAM1272) TrustRAM Offset */
#define TRAM_RAM1273_REG_OFST          _UINT32_(0x23E4)    /* (TRAM_RAM1273) TrustRAM Offset */
#define TRAM_RAM1274_REG_OFST          _UINT32_(0x23E8)    /* (TRAM_RAM1274) TrustRAM Offset */
#define TRAM_RAM1275_REG_OFST          _UINT32_(0x23EC)    /* (TRAM_RAM1275) TrustRAM Offset */
#define TRAM_RAM1276_REG_OFST          _UINT32_(0x23F0)    /* (TRAM_RAM1276) TrustRAM Offset */
#define TRAM_RAM1277_REG_OFST          _UINT32_(0x23F4)    /* (TRAM_RAM1277) TrustRAM Offset */
#define TRAM_RAM1278_REG_OFST          _UINT32_(0x23F8)    /* (TRAM_RAM1278) TrustRAM Offset */
#define TRAM_RAM1279_REG_OFST          _UINT32_(0x23FC)    /* (TRAM_RAM1279) TrustRAM Offset */
#define TRAM_RAM1280_REG_OFST          _UINT32_(0x2400)    /* (TRAM_RAM1280) TrustRAM Offset */
#define TRAM_RAM1281_REG_OFST          _UINT32_(0x2404)    /* (TRAM_RAM1281) TrustRAM Offset */
#define TRAM_RAM1282_REG_OFST          _UINT32_(0x2408)    /* (TRAM_RAM1282) TrustRAM Offset */
#define TRAM_RAM1283_REG_OFST          _UINT32_(0x240C)    /* (TRAM_RAM1283) TrustRAM Offset */
#define TRAM_RAM1284_REG_OFST          _UINT32_(0x2410)    /* (TRAM_RAM1284) TrustRAM Offset */
#define TRAM_RAM1285_REG_OFST          _UINT32_(0x2414)    /* (TRAM_RAM1285) TrustRAM Offset */
#define TRAM_RAM1286_REG_OFST          _UINT32_(0x2418)    /* (TRAM_RAM1286) TrustRAM Offset */
#define TRAM_RAM1287_REG_OFST          _UINT32_(0x241C)    /* (TRAM_RAM1287) TrustRAM Offset */
#define TRAM_RAM1288_REG_OFST          _UINT32_(0x2420)    /* (TRAM_RAM1288) TrustRAM Offset */
#define TRAM_RAM1289_REG_OFST          _UINT32_(0x2424)    /* (TRAM_RAM1289) TrustRAM Offset */
#define TRAM_RAM1290_REG_OFST          _UINT32_(0x2428)    /* (TRAM_RAM1290) TrustRAM Offset */
#define TRAM_RAM1291_REG_OFST          _UINT32_(0x242C)    /* (TRAM_RAM1291) TrustRAM Offset */
#define TRAM_RAM1292_REG_OFST          _UINT32_(0x2430)    /* (TRAM_RAM1292) TrustRAM Offset */
#define TRAM_RAM1293_REG_OFST          _UINT32_(0x2434)    /* (TRAM_RAM1293) TrustRAM Offset */
#define TRAM_RAM1294_REG_OFST          _UINT32_(0x2438)    /* (TRAM_RAM1294) TrustRAM Offset */
#define TRAM_RAM1295_REG_OFST          _UINT32_(0x243C)    /* (TRAM_RAM1295) TrustRAM Offset */
#define TRAM_RAM1296_REG_OFST          _UINT32_(0x2440)    /* (TRAM_RAM1296) TrustRAM Offset */
#define TRAM_RAM1297_REG_OFST          _UINT32_(0x2444)    /* (TRAM_RAM1297) TrustRAM Offset */
#define TRAM_RAM1298_REG_OFST          _UINT32_(0x2448)    /* (TRAM_RAM1298) TrustRAM Offset */
#define TRAM_RAM1299_REG_OFST          _UINT32_(0x244C)    /* (TRAM_RAM1299) TrustRAM Offset */
#define TRAM_RAM1300_REG_OFST          _UINT32_(0x2450)    /* (TRAM_RAM1300) TrustRAM Offset */
#define TRAM_RAM1301_REG_OFST          _UINT32_(0x2454)    /* (TRAM_RAM1301) TrustRAM Offset */
#define TRAM_RAM1302_REG_OFST          _UINT32_(0x2458)    /* (TRAM_RAM1302) TrustRAM Offset */
#define TRAM_RAM1303_REG_OFST          _UINT32_(0x245C)    /* (TRAM_RAM1303) TrustRAM Offset */
#define TRAM_RAM1304_REG_OFST          _UINT32_(0x2460)    /* (TRAM_RAM1304) TrustRAM Offset */
#define TRAM_RAM1305_REG_OFST          _UINT32_(0x2464)    /* (TRAM_RAM1305) TrustRAM Offset */
#define TRAM_RAM1306_REG_OFST          _UINT32_(0x2468)    /* (TRAM_RAM1306) TrustRAM Offset */
#define TRAM_RAM1307_REG_OFST          _UINT32_(0x246C)    /* (TRAM_RAM1307) TrustRAM Offset */
#define TRAM_RAM1308_REG_OFST          _UINT32_(0x2470)    /* (TRAM_RAM1308) TrustRAM Offset */
#define TRAM_RAM1309_REG_OFST          _UINT32_(0x2474)    /* (TRAM_RAM1309) TrustRAM Offset */
#define TRAM_RAM1310_REG_OFST          _UINT32_(0x2478)    /* (TRAM_RAM1310) TrustRAM Offset */
#define TRAM_RAM1311_REG_OFST          _UINT32_(0x247C)    /* (TRAM_RAM1311) TrustRAM Offset */
#define TRAM_RAM1312_REG_OFST          _UINT32_(0x2480)    /* (TRAM_RAM1312) TrustRAM Offset */
#define TRAM_RAM1313_REG_OFST          _UINT32_(0x2484)    /* (TRAM_RAM1313) TrustRAM Offset */
#define TRAM_RAM1314_REG_OFST          _UINT32_(0x2488)    /* (TRAM_RAM1314) TrustRAM Offset */
#define TRAM_RAM1315_REG_OFST          _UINT32_(0x248C)    /* (TRAM_RAM1315) TrustRAM Offset */
#define TRAM_RAM1316_REG_OFST          _UINT32_(0x2490)    /* (TRAM_RAM1316) TrustRAM Offset */
#define TRAM_RAM1317_REG_OFST          _UINT32_(0x2494)    /* (TRAM_RAM1317) TrustRAM Offset */
#define TRAM_RAM1318_REG_OFST          _UINT32_(0x2498)    /* (TRAM_RAM1318) TrustRAM Offset */
#define TRAM_RAM1319_REG_OFST          _UINT32_(0x249C)    /* (TRAM_RAM1319) TrustRAM Offset */
#define TRAM_RAM1320_REG_OFST          _UINT32_(0x24A0)    /* (TRAM_RAM1320) TrustRAM Offset */
#define TRAM_RAM1321_REG_OFST          _UINT32_(0x24A4)    /* (TRAM_RAM1321) TrustRAM Offset */
#define TRAM_RAM1322_REG_OFST          _UINT32_(0x24A8)    /* (TRAM_RAM1322) TrustRAM Offset */
#define TRAM_RAM1323_REG_OFST          _UINT32_(0x24AC)    /* (TRAM_RAM1323) TrustRAM Offset */
#define TRAM_RAM1324_REG_OFST          _UINT32_(0x24B0)    /* (TRAM_RAM1324) TrustRAM Offset */
#define TRAM_RAM1325_REG_OFST          _UINT32_(0x24B4)    /* (TRAM_RAM1325) TrustRAM Offset */
#define TRAM_RAM1326_REG_OFST          _UINT32_(0x24B8)    /* (TRAM_RAM1326) TrustRAM Offset */
#define TRAM_RAM1327_REG_OFST          _UINT32_(0x24BC)    /* (TRAM_RAM1327) TrustRAM Offset */
#define TRAM_RAM1328_REG_OFST          _UINT32_(0x24C0)    /* (TRAM_RAM1328) TrustRAM Offset */
#define TRAM_RAM1329_REG_OFST          _UINT32_(0x24C4)    /* (TRAM_RAM1329) TrustRAM Offset */
#define TRAM_RAM1330_REG_OFST          _UINT32_(0x24C8)    /* (TRAM_RAM1330) TrustRAM Offset */
#define TRAM_RAM1331_REG_OFST          _UINT32_(0x24CC)    /* (TRAM_RAM1331) TrustRAM Offset */
#define TRAM_RAM1332_REG_OFST          _UINT32_(0x24D0)    /* (TRAM_RAM1332) TrustRAM Offset */
#define TRAM_RAM1333_REG_OFST          _UINT32_(0x24D4)    /* (TRAM_RAM1333) TrustRAM Offset */
#define TRAM_RAM1334_REG_OFST          _UINT32_(0x24D8)    /* (TRAM_RAM1334) TrustRAM Offset */
#define TRAM_RAM1335_REG_OFST          _UINT32_(0x24DC)    /* (TRAM_RAM1335) TrustRAM Offset */
#define TRAM_RAM1336_REG_OFST          _UINT32_(0x24E0)    /* (TRAM_RAM1336) TrustRAM Offset */
#define TRAM_RAM1337_REG_OFST          _UINT32_(0x24E4)    /* (TRAM_RAM1337) TrustRAM Offset */
#define TRAM_RAM1338_REG_OFST          _UINT32_(0x24E8)    /* (TRAM_RAM1338) TrustRAM Offset */
#define TRAM_RAM1339_REG_OFST          _UINT32_(0x24EC)    /* (TRAM_RAM1339) TrustRAM Offset */
#define TRAM_RAM1340_REG_OFST          _UINT32_(0x24F0)    /* (TRAM_RAM1340) TrustRAM Offset */
#define TRAM_RAM1341_REG_OFST          _UINT32_(0x24F4)    /* (TRAM_RAM1341) TrustRAM Offset */
#define TRAM_RAM1342_REG_OFST          _UINT32_(0x24F8)    /* (TRAM_RAM1342) TrustRAM Offset */
#define TRAM_RAM1343_REG_OFST          _UINT32_(0x24FC)    /* (TRAM_RAM1343) TrustRAM Offset */
#define TRAM_RAM1344_REG_OFST          _UINT32_(0x2500)    /* (TRAM_RAM1344) TrustRAM Offset */
#define TRAM_RAM1345_REG_OFST          _UINT32_(0x2504)    /* (TRAM_RAM1345) TrustRAM Offset */
#define TRAM_RAM1346_REG_OFST          _UINT32_(0x2508)    /* (TRAM_RAM1346) TrustRAM Offset */
#define TRAM_RAM1347_REG_OFST          _UINT32_(0x250C)    /* (TRAM_RAM1347) TrustRAM Offset */
#define TRAM_RAM1348_REG_OFST          _UINT32_(0x2510)    /* (TRAM_RAM1348) TrustRAM Offset */
#define TRAM_RAM1349_REG_OFST          _UINT32_(0x2514)    /* (TRAM_RAM1349) TrustRAM Offset */
#define TRAM_RAM1350_REG_OFST          _UINT32_(0x2518)    /* (TRAM_RAM1350) TrustRAM Offset */
#define TRAM_RAM1351_REG_OFST          _UINT32_(0x251C)    /* (TRAM_RAM1351) TrustRAM Offset */
#define TRAM_RAM1352_REG_OFST          _UINT32_(0x2520)    /* (TRAM_RAM1352) TrustRAM Offset */
#define TRAM_RAM1353_REG_OFST          _UINT32_(0x2524)    /* (TRAM_RAM1353) TrustRAM Offset */
#define TRAM_RAM1354_REG_OFST          _UINT32_(0x2528)    /* (TRAM_RAM1354) TrustRAM Offset */
#define TRAM_RAM1355_REG_OFST          _UINT32_(0x252C)    /* (TRAM_RAM1355) TrustRAM Offset */
#define TRAM_RAM1356_REG_OFST          _UINT32_(0x2530)    /* (TRAM_RAM1356) TrustRAM Offset */
#define TRAM_RAM1357_REG_OFST          _UINT32_(0x2534)    /* (TRAM_RAM1357) TrustRAM Offset */
#define TRAM_RAM1358_REG_OFST          _UINT32_(0x2538)    /* (TRAM_RAM1358) TrustRAM Offset */
#define TRAM_RAM1359_REG_OFST          _UINT32_(0x253C)    /* (TRAM_RAM1359) TrustRAM Offset */
#define TRAM_RAM1360_REG_OFST          _UINT32_(0x2540)    /* (TRAM_RAM1360) TrustRAM Offset */
#define TRAM_RAM1361_REG_OFST          _UINT32_(0x2544)    /* (TRAM_RAM1361) TrustRAM Offset */
#define TRAM_RAM1362_REG_OFST          _UINT32_(0x2548)    /* (TRAM_RAM1362) TrustRAM Offset */
#define TRAM_RAM1363_REG_OFST          _UINT32_(0x254C)    /* (TRAM_RAM1363) TrustRAM Offset */
#define TRAM_RAM1364_REG_OFST          _UINT32_(0x2550)    /* (TRAM_RAM1364) TrustRAM Offset */
#define TRAM_RAM1365_REG_OFST          _UINT32_(0x2554)    /* (TRAM_RAM1365) TrustRAM Offset */
#define TRAM_RAM1366_REG_OFST          _UINT32_(0x2558)    /* (TRAM_RAM1366) TrustRAM Offset */
#define TRAM_RAM1367_REG_OFST          _UINT32_(0x255C)    /* (TRAM_RAM1367) TrustRAM Offset */
#define TRAM_RAM1368_REG_OFST          _UINT32_(0x2560)    /* (TRAM_RAM1368) TrustRAM Offset */
#define TRAM_RAM1369_REG_OFST          _UINT32_(0x2564)    /* (TRAM_RAM1369) TrustRAM Offset */
#define TRAM_RAM1370_REG_OFST          _UINT32_(0x2568)    /* (TRAM_RAM1370) TrustRAM Offset */
#define TRAM_RAM1371_REG_OFST          _UINT32_(0x256C)    /* (TRAM_RAM1371) TrustRAM Offset */
#define TRAM_RAM1372_REG_OFST          _UINT32_(0x2570)    /* (TRAM_RAM1372) TrustRAM Offset */
#define TRAM_RAM1373_REG_OFST          _UINT32_(0x2574)    /* (TRAM_RAM1373) TrustRAM Offset */
#define TRAM_RAM1374_REG_OFST          _UINT32_(0x2578)    /* (TRAM_RAM1374) TrustRAM Offset */
#define TRAM_RAM1375_REG_OFST          _UINT32_(0x257C)    /* (TRAM_RAM1375) TrustRAM Offset */
#define TRAM_RAM1376_REG_OFST          _UINT32_(0x2580)    /* (TRAM_RAM1376) TrustRAM Offset */
#define TRAM_RAM1377_REG_OFST          _UINT32_(0x2584)    /* (TRAM_RAM1377) TrustRAM Offset */
#define TRAM_RAM1378_REG_OFST          _UINT32_(0x2588)    /* (TRAM_RAM1378) TrustRAM Offset */
#define TRAM_RAM1379_REG_OFST          _UINT32_(0x258C)    /* (TRAM_RAM1379) TrustRAM Offset */
#define TRAM_RAM1380_REG_OFST          _UINT32_(0x2590)    /* (TRAM_RAM1380) TrustRAM Offset */
#define TRAM_RAM1381_REG_OFST          _UINT32_(0x2594)    /* (TRAM_RAM1381) TrustRAM Offset */
#define TRAM_RAM1382_REG_OFST          _UINT32_(0x2598)    /* (TRAM_RAM1382) TrustRAM Offset */
#define TRAM_RAM1383_REG_OFST          _UINT32_(0x259C)    /* (TRAM_RAM1383) TrustRAM Offset */
#define TRAM_RAM1384_REG_OFST          _UINT32_(0x25A0)    /* (TRAM_RAM1384) TrustRAM Offset */
#define TRAM_RAM1385_REG_OFST          _UINT32_(0x25A4)    /* (TRAM_RAM1385) TrustRAM Offset */
#define TRAM_RAM1386_REG_OFST          _UINT32_(0x25A8)    /* (TRAM_RAM1386) TrustRAM Offset */
#define TRAM_RAM1387_REG_OFST          _UINT32_(0x25AC)    /* (TRAM_RAM1387) TrustRAM Offset */
#define TRAM_RAM1388_REG_OFST          _UINT32_(0x25B0)    /* (TRAM_RAM1388) TrustRAM Offset */
#define TRAM_RAM1389_REG_OFST          _UINT32_(0x25B4)    /* (TRAM_RAM1389) TrustRAM Offset */
#define TRAM_RAM1390_REG_OFST          _UINT32_(0x25B8)    /* (TRAM_RAM1390) TrustRAM Offset */
#define TRAM_RAM1391_REG_OFST          _UINT32_(0x25BC)    /* (TRAM_RAM1391) TrustRAM Offset */
#define TRAM_RAM1392_REG_OFST          _UINT32_(0x25C0)    /* (TRAM_RAM1392) TrustRAM Offset */
#define TRAM_RAM1393_REG_OFST          _UINT32_(0x25C4)    /* (TRAM_RAM1393) TrustRAM Offset */
#define TRAM_RAM1394_REG_OFST          _UINT32_(0x25C8)    /* (TRAM_RAM1394) TrustRAM Offset */
#define TRAM_RAM1395_REG_OFST          _UINT32_(0x25CC)    /* (TRAM_RAM1395) TrustRAM Offset */
#define TRAM_RAM1396_REG_OFST          _UINT32_(0x25D0)    /* (TRAM_RAM1396) TrustRAM Offset */
#define TRAM_RAM1397_REG_OFST          _UINT32_(0x25D4)    /* (TRAM_RAM1397) TrustRAM Offset */
#define TRAM_RAM1398_REG_OFST          _UINT32_(0x25D8)    /* (TRAM_RAM1398) TrustRAM Offset */
#define TRAM_RAM1399_REG_OFST          _UINT32_(0x25DC)    /* (TRAM_RAM1399) TrustRAM Offset */
#define TRAM_RAM1400_REG_OFST          _UINT32_(0x25E0)    /* (TRAM_RAM1400) TrustRAM Offset */
#define TRAM_RAM1401_REG_OFST          _UINT32_(0x25E4)    /* (TRAM_RAM1401) TrustRAM Offset */
#define TRAM_RAM1402_REG_OFST          _UINT32_(0x25E8)    /* (TRAM_RAM1402) TrustRAM Offset */
#define TRAM_RAM1403_REG_OFST          _UINT32_(0x25EC)    /* (TRAM_RAM1403) TrustRAM Offset */
#define TRAM_RAM1404_REG_OFST          _UINT32_(0x25F0)    /* (TRAM_RAM1404) TrustRAM Offset */
#define TRAM_RAM1405_REG_OFST          _UINT32_(0x25F4)    /* (TRAM_RAM1405) TrustRAM Offset */
#define TRAM_RAM1406_REG_OFST          _UINT32_(0x25F8)    /* (TRAM_RAM1406) TrustRAM Offset */
#define TRAM_RAM1407_REG_OFST          _UINT32_(0x25FC)    /* (TRAM_RAM1407) TrustRAM Offset */
#define TRAM_RAM1408_REG_OFST          _UINT32_(0x2600)    /* (TRAM_RAM1408) TrustRAM Offset */
#define TRAM_RAM1409_REG_OFST          _UINT32_(0x2604)    /* (TRAM_RAM1409) TrustRAM Offset */
#define TRAM_RAM1410_REG_OFST          _UINT32_(0x2608)    /* (TRAM_RAM1410) TrustRAM Offset */
#define TRAM_RAM1411_REG_OFST          _UINT32_(0x260C)    /* (TRAM_RAM1411) TrustRAM Offset */
#define TRAM_RAM1412_REG_OFST          _UINT32_(0x2610)    /* (TRAM_RAM1412) TrustRAM Offset */
#define TRAM_RAM1413_REG_OFST          _UINT32_(0x2614)    /* (TRAM_RAM1413) TrustRAM Offset */
#define TRAM_RAM1414_REG_OFST          _UINT32_(0x2618)    /* (TRAM_RAM1414) TrustRAM Offset */
#define TRAM_RAM1415_REG_OFST          _UINT32_(0x261C)    /* (TRAM_RAM1415) TrustRAM Offset */
#define TRAM_RAM1416_REG_OFST          _UINT32_(0x2620)    /* (TRAM_RAM1416) TrustRAM Offset */
#define TRAM_RAM1417_REG_OFST          _UINT32_(0x2624)    /* (TRAM_RAM1417) TrustRAM Offset */
#define TRAM_RAM1418_REG_OFST          _UINT32_(0x2628)    /* (TRAM_RAM1418) TrustRAM Offset */
#define TRAM_RAM1419_REG_OFST          _UINT32_(0x262C)    /* (TRAM_RAM1419) TrustRAM Offset */
#define TRAM_RAM1420_REG_OFST          _UINT32_(0x2630)    /* (TRAM_RAM1420) TrustRAM Offset */
#define TRAM_RAM1421_REG_OFST          _UINT32_(0x2634)    /* (TRAM_RAM1421) TrustRAM Offset */
#define TRAM_RAM1422_REG_OFST          _UINT32_(0x2638)    /* (TRAM_RAM1422) TrustRAM Offset */
#define TRAM_RAM1423_REG_OFST          _UINT32_(0x263C)    /* (TRAM_RAM1423) TrustRAM Offset */
#define TRAM_RAM1424_REG_OFST          _UINT32_(0x2640)    /* (TRAM_RAM1424) TrustRAM Offset */
#define TRAM_RAM1425_REG_OFST          _UINT32_(0x2644)    /* (TRAM_RAM1425) TrustRAM Offset */
#define TRAM_RAM1426_REG_OFST          _UINT32_(0x2648)    /* (TRAM_RAM1426) TrustRAM Offset */
#define TRAM_RAM1427_REG_OFST          _UINT32_(0x264C)    /* (TRAM_RAM1427) TrustRAM Offset */
#define TRAM_RAM1428_REG_OFST          _UINT32_(0x2650)    /* (TRAM_RAM1428) TrustRAM Offset */
#define TRAM_RAM1429_REG_OFST          _UINT32_(0x2654)    /* (TRAM_RAM1429) TrustRAM Offset */
#define TRAM_RAM1430_REG_OFST          _UINT32_(0x2658)    /* (TRAM_RAM1430) TrustRAM Offset */
#define TRAM_RAM1431_REG_OFST          _UINT32_(0x265C)    /* (TRAM_RAM1431) TrustRAM Offset */
#define TRAM_RAM1432_REG_OFST          _UINT32_(0x2660)    /* (TRAM_RAM1432) TrustRAM Offset */
#define TRAM_RAM1433_REG_OFST          _UINT32_(0x2664)    /* (TRAM_RAM1433) TrustRAM Offset */
#define TRAM_RAM1434_REG_OFST          _UINT32_(0x2668)    /* (TRAM_RAM1434) TrustRAM Offset */
#define TRAM_RAM1435_REG_OFST          _UINT32_(0x266C)    /* (TRAM_RAM1435) TrustRAM Offset */
#define TRAM_RAM1436_REG_OFST          _UINT32_(0x2670)    /* (TRAM_RAM1436) TrustRAM Offset */
#define TRAM_RAM1437_REG_OFST          _UINT32_(0x2674)    /* (TRAM_RAM1437) TrustRAM Offset */
#define TRAM_RAM1438_REG_OFST          _UINT32_(0x2678)    /* (TRAM_RAM1438) TrustRAM Offset */
#define TRAM_RAM1439_REG_OFST          _UINT32_(0x267C)    /* (TRAM_RAM1439) TrustRAM Offset */
#define TRAM_RAM1440_REG_OFST          _UINT32_(0x2680)    /* (TRAM_RAM1440) TrustRAM Offset */
#define TRAM_RAM1441_REG_OFST          _UINT32_(0x2684)    /* (TRAM_RAM1441) TrustRAM Offset */
#define TRAM_RAM1442_REG_OFST          _UINT32_(0x2688)    /* (TRAM_RAM1442) TrustRAM Offset */
#define TRAM_RAM1443_REG_OFST          _UINT32_(0x268C)    /* (TRAM_RAM1443) TrustRAM Offset */
#define TRAM_RAM1444_REG_OFST          _UINT32_(0x2690)    /* (TRAM_RAM1444) TrustRAM Offset */
#define TRAM_RAM1445_REG_OFST          _UINT32_(0x2694)    /* (TRAM_RAM1445) TrustRAM Offset */
#define TRAM_RAM1446_REG_OFST          _UINT32_(0x2698)    /* (TRAM_RAM1446) TrustRAM Offset */
#define TRAM_RAM1447_REG_OFST          _UINT32_(0x269C)    /* (TRAM_RAM1447) TrustRAM Offset */
#define TRAM_RAM1448_REG_OFST          _UINT32_(0x26A0)    /* (TRAM_RAM1448) TrustRAM Offset */
#define TRAM_RAM1449_REG_OFST          _UINT32_(0x26A4)    /* (TRAM_RAM1449) TrustRAM Offset */
#define TRAM_RAM1450_REG_OFST          _UINT32_(0x26A8)    /* (TRAM_RAM1450) TrustRAM Offset */
#define TRAM_RAM1451_REG_OFST          _UINT32_(0x26AC)    /* (TRAM_RAM1451) TrustRAM Offset */
#define TRAM_RAM1452_REG_OFST          _UINT32_(0x26B0)    /* (TRAM_RAM1452) TrustRAM Offset */
#define TRAM_RAM1453_REG_OFST          _UINT32_(0x26B4)    /* (TRAM_RAM1453) TrustRAM Offset */
#define TRAM_RAM1454_REG_OFST          _UINT32_(0x26B8)    /* (TRAM_RAM1454) TrustRAM Offset */
#define TRAM_RAM1455_REG_OFST          _UINT32_(0x26BC)    /* (TRAM_RAM1455) TrustRAM Offset */
#define TRAM_RAM1456_REG_OFST          _UINT32_(0x26C0)    /* (TRAM_RAM1456) TrustRAM Offset */
#define TRAM_RAM1457_REG_OFST          _UINT32_(0x26C4)    /* (TRAM_RAM1457) TrustRAM Offset */
#define TRAM_RAM1458_REG_OFST          _UINT32_(0x26C8)    /* (TRAM_RAM1458) TrustRAM Offset */
#define TRAM_RAM1459_REG_OFST          _UINT32_(0x26CC)    /* (TRAM_RAM1459) TrustRAM Offset */
#define TRAM_RAM1460_REG_OFST          _UINT32_(0x26D0)    /* (TRAM_RAM1460) TrustRAM Offset */
#define TRAM_RAM1461_REG_OFST          _UINT32_(0x26D4)    /* (TRAM_RAM1461) TrustRAM Offset */
#define TRAM_RAM1462_REG_OFST          _UINT32_(0x26D8)    /* (TRAM_RAM1462) TrustRAM Offset */
#define TRAM_RAM1463_REG_OFST          _UINT32_(0x26DC)    /* (TRAM_RAM1463) TrustRAM Offset */
#define TRAM_RAM1464_REG_OFST          _UINT32_(0x26E0)    /* (TRAM_RAM1464) TrustRAM Offset */
#define TRAM_RAM1465_REG_OFST          _UINT32_(0x26E4)    /* (TRAM_RAM1465) TrustRAM Offset */
#define TRAM_RAM1466_REG_OFST          _UINT32_(0x26E8)    /* (TRAM_RAM1466) TrustRAM Offset */
#define TRAM_RAM1467_REG_OFST          _UINT32_(0x26EC)    /* (TRAM_RAM1467) TrustRAM Offset */
#define TRAM_RAM1468_REG_OFST          _UINT32_(0x26F0)    /* (TRAM_RAM1468) TrustRAM Offset */
#define TRAM_RAM1469_REG_OFST          _UINT32_(0x26F4)    /* (TRAM_RAM1469) TrustRAM Offset */
#define TRAM_RAM1470_REG_OFST          _UINT32_(0x26F8)    /* (TRAM_RAM1470) TrustRAM Offset */
#define TRAM_RAM1471_REG_OFST          _UINT32_(0x26FC)    /* (TRAM_RAM1471) TrustRAM Offset */
#define TRAM_RAM1472_REG_OFST          _UINT32_(0x2700)    /* (TRAM_RAM1472) TrustRAM Offset */
#define TRAM_RAM1473_REG_OFST          _UINT32_(0x2704)    /* (TRAM_RAM1473) TrustRAM Offset */
#define TRAM_RAM1474_REG_OFST          _UINT32_(0x2708)    /* (TRAM_RAM1474) TrustRAM Offset */
#define TRAM_RAM1475_REG_OFST          _UINT32_(0x270C)    /* (TRAM_RAM1475) TrustRAM Offset */
#define TRAM_RAM1476_REG_OFST          _UINT32_(0x2710)    /* (TRAM_RAM1476) TrustRAM Offset */
#define TRAM_RAM1477_REG_OFST          _UINT32_(0x2714)    /* (TRAM_RAM1477) TrustRAM Offset */
#define TRAM_RAM1478_REG_OFST          _UINT32_(0x2718)    /* (TRAM_RAM1478) TrustRAM Offset */
#define TRAM_RAM1479_REG_OFST          _UINT32_(0x271C)    /* (TRAM_RAM1479) TrustRAM Offset */
#define TRAM_RAM1480_REG_OFST          _UINT32_(0x2720)    /* (TRAM_RAM1480) TrustRAM Offset */
#define TRAM_RAM1481_REG_OFST          _UINT32_(0x2724)    /* (TRAM_RAM1481) TrustRAM Offset */
#define TRAM_RAM1482_REG_OFST          _UINT32_(0x2728)    /* (TRAM_RAM1482) TrustRAM Offset */
#define TRAM_RAM1483_REG_OFST          _UINT32_(0x272C)    /* (TRAM_RAM1483) TrustRAM Offset */
#define TRAM_RAM1484_REG_OFST          _UINT32_(0x2730)    /* (TRAM_RAM1484) TrustRAM Offset */
#define TRAM_RAM1485_REG_OFST          _UINT32_(0x2734)    /* (TRAM_RAM1485) TrustRAM Offset */
#define TRAM_RAM1486_REG_OFST          _UINT32_(0x2738)    /* (TRAM_RAM1486) TrustRAM Offset */
#define TRAM_RAM1487_REG_OFST          _UINT32_(0x273C)    /* (TRAM_RAM1487) TrustRAM Offset */
#define TRAM_RAM1488_REG_OFST          _UINT32_(0x2740)    /* (TRAM_RAM1488) TrustRAM Offset */
#define TRAM_RAM1489_REG_OFST          _UINT32_(0x2744)    /* (TRAM_RAM1489) TrustRAM Offset */
#define TRAM_RAM1490_REG_OFST          _UINT32_(0x2748)    /* (TRAM_RAM1490) TrustRAM Offset */
#define TRAM_RAM1491_REG_OFST          _UINT32_(0x274C)    /* (TRAM_RAM1491) TrustRAM Offset */
#define TRAM_RAM1492_REG_OFST          _UINT32_(0x2750)    /* (TRAM_RAM1492) TrustRAM Offset */
#define TRAM_RAM1493_REG_OFST          _UINT32_(0x2754)    /* (TRAM_RAM1493) TrustRAM Offset */
#define TRAM_RAM1494_REG_OFST          _UINT32_(0x2758)    /* (TRAM_RAM1494) TrustRAM Offset */
#define TRAM_RAM1495_REG_OFST          _UINT32_(0x275C)    /* (TRAM_RAM1495) TrustRAM Offset */
#define TRAM_RAM1496_REG_OFST          _UINT32_(0x2760)    /* (TRAM_RAM1496) TrustRAM Offset */
#define TRAM_RAM1497_REG_OFST          _UINT32_(0x2764)    /* (TRAM_RAM1497) TrustRAM Offset */
